УТ.УчетЗадач/src/Documents/cbr_ТрудозатратыПоЗадаче/cbr_ТрудозатратыПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_ТрудозатратыПоЗадаче</name>
  <comment>Трудозатраты по задаче</comment>
  <basedOn>Document.cbr_Задача</basedOn>
  <registerRecords>AccumulationRegister.cbr_ЧасыТрудозатрат</registerRecords>
  <attributes>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УТ.УчетЗадач/src/AccumulationRegisters/cbr_ЧасыТрудозатрат/cbr_ЧасыТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ЧасыТрудозатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ОценкаЧасов/cbr_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОценки</name>
    <type>
      <types>EnumRef.cbr_ТипОценкиЧасов</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/cbr_ТипОценкиЧасов/cbr_ТипОценкиЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ТипОценкиЧасов</name>
  <enumValues>
    <name>Рамочная</name>
  </enumValues>
  <enumValues>
    <name>Точная</name>
  </enumValues>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Documents/cbr_ТрудозатратыПоЗадаче/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.cbr_Задача") Тогда
		Часы = 8;
		Основание = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.cbr_ЧасыТрудозатрат.Записывать = Истина;	
	Движение = Движения.cbr_ЧасыТрудозатрат.Добавить();
	Движение.Период = Дата;
	Движение.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Движение.Часы = Часы;	
	Движения.cbr_ЧасыТрудозатрат.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Центр_ЧасыТрудозатрат.Часы) КАК Часы,
	|	Центр_ТрудозатратыПоЗадаче.Основание
	|ПОМЕСТИТЬ вт_ЧасыПоЗадаче
	|ИЗ
	|	Документ.cbr_ТрудозатратыПоЗадаче КАК Центр_ТрудозатратыПоЗадаче
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ЧасыТрудозатрат КАК Центр_ЧасыТрудозатрат
	|		ПО Центр_ЧасыТрудозатрат.Регистратор = Центр_ТрудозатратыПоЗадаче.Ссылка
	|		И Центр_ТрудозатратыПоЗадаче.Основание = &Задача
	|СГРУППИРОВАТЬ ПО
	|	Центр_ТрудозатратыПоЗадаче.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЧасыПоЗадаче.Часы,
	|	Центр_ОценкаЧасовСрезПоследних.До,
	|	Центр_ОценкаЧасовСрезПоследних.ТипОценки
	|ИЗ
	|	вт_ЧасыПоЗадаче КАК вт_ЧасыПоЗадаче
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ОценкаЧасов.СрезПоследних(, Задача = &Задача) КАК
	|			Центр_ОценкаЧасовСрезПоследних
	|		ПО вт_ЧасыПоЗадаче.Основание = Центр_ОценкаЧасовСрезПоследних.Задача
	|ГДЕ
	|	Центр_ОценкаЧасовСрезПоследних.Согласовано";

	Запрос.УстановитьПараметр("Задача", Основание);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.ТипОценки <> ПредопределенноеЗначение("Перечисление.cbr_ТипОценкиЧасов.ПоФакту") Тогда
			ЧасыИтог = 	Выборка.До - Выборка.Часы;
			Если ЧасыИтог < 0 Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Часов больше чем согласовано";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

#КонецОбласти
